In [ ]:
import pandas as pd
data = pd.read_csv("/content/Netflix_movies_and_tv_shows_clustering.csv")

In [ ]:
data.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,TV Show,3%,NaN,"João Miguel, Bianca Comparato, Michel Gomes, R...",Brazil,"August 14, 2020",2020,TV-MA,4 Seasons,"International TV Shows, TV Dramas, TV Sci-Fi &...",In a future where the elite inhabit an island ...
1,s2,Movie,7:19,Jorge Michel Grau,"Demián Bichir, Héctor Bonilla, Oscar Serrano, ...",Mexico,"December 23, 2016",2016,TV-MA,93 min,"Dramas, International Movies",After a devastating earthquake hits Mexico Cit...
2,s3,Movie,23:59,Gilbert Chan,"Tedd Chan, Stella Chung, Henley Hii, Lawrence ...",Singapore,"December 20, 2018",2011,R,78 min,"Horror Movies, International Movies","When an army recruit is found dead, his fellow..."
3,s4,Movie,9,Shane Acker,"Elijah Wood, John C. Reilly, Jennifer Connelly...",United States,"November 16, 2017",2009,PG-13,80 min,"Action & Adventure, Independent Movies, Sci-Fi...","In a postapocalyptic world, rag-doll robots hi..."
4,s5,Movie,21,Robert Luketic,"Jim Sturgess, Kevin Spacey, Kate Bosworth, Aar...",United States,"January 1, 2020",2008,PG-13,123 min,Dramas,A brilliant group of students become card-coun...

In [ ]:
data.shape

(7787, 12)

In [ ]:
data.nunique()

show_id         7787
type               2
title           7787
director        4049
cast            6831
country          681
date_added      1565
release_year      73
rating            14
duration         216
listed_in        492
description     7769
dtype: int64

In [ ]:
data.duplicated().value_counts()

False    7787
Name: count, dtype: int64

In [ ]:
data.isna().sum()

show_id            0
type               0
title              0
director        2389
cast             718
country          507
date_added        10
release_year       0
rating             7
duration           0
listed_in          0
description        0
dtype: int64

In [ ]:
data[['director','cast','country']] = data[['director','cast','country']].fillna('Unknown')
data['rating'] = data['rating'].fillna(data['rating'].mode()[0])
data.dropna(axis=0, inplace = True)

In [ ]:
data.shape

(7777, 12)

In [ ]:
data.country.value_counts()

country
United States                                     2549
India                                              923
Unknown                                            506
United Kingdom                                     396
Japan                                              225
                                                  ...
Peru, United States, United Kingdom                  1
Saudi Arabia, United Arab Emirates                   1
United Kingdom, France, United States, Belgium       1
France, Norway, Lebanon, Belgium                     1
Austria, Iraq, United States                         1
Name: count, Length: 682, dtype: int64

In [ ]:
data.listed_in.value_counts()

listed_in
Documentaries                                                334
Stand-Up Comedy                                              321
Dramas, International Movies                                 320
Comedies, Dramas, International Movies                       243
Dramas, Independent Movies, International Movies             215
                                                            ...
Sports Movies                                                  1
Crime TV Shows, TV Horror, TV Mysteries                        1
Children & Family Movies, Classic Movies, Dramas               1
Romantic TV Shows, Spanish-Language TV Shows, TV Comedies      1
Dramas, Faith & Spirituality, Sports Movies                    1
Name: count, Length: 491, dtype: int64

In [ ]:
data['country'] = data['country'].apply(lambda x: x.split(',')[0])
data['listed_in'] = data['listed_in'].apply(lambda x: x.split(',')[0])

In [ ]:
data.country.value_counts()

country
United States     2877
India              956
United Kingdom     576
Unknown            506
Canada             259
                  ...
Jamaica              1
Cyprus               1
Greece               1
Paraguay             1
Somalia              1
Name: count, Length: 82, dtype: int64

In [ ]:
data.listed_in.value_counts()

listed_in
Dramas                          1384
Comedies                        1074
Documentaries                    751
Action & Adventure               721
International TV Shows           689
Children & Family Movies         502
Crime TV Shows                   369
Kids' TV                         357
Stand-Up Comedy                  321
Horror Movies                    244
British TV Shows                 231
Docuseries                       193
Anime Series                     147
International Movies             114
TV Comedies                      109
Reality TV                       102
Classic Movies                    77
TV Dramas                         62
Movies                            56
Thrillers                         49
TV Action & Adventure             36
Stand-Up Comedy & Talk Shows      33
Romantic TV Shows                 28
Independent Movies                20
Classic & Cult TV                 19
Anime Features                    19
Music & Musicals                  17
TV Shows                          12
Cult Movies                       12
Sci-Fi & Fantasy                  11
TV Horror                         10
Romantic Movies                    3
Spanish-Language TV Shows          2
Sports Movies                      1
TV Sci-Fi & Fantasy                1
LGBTQ Movies                       1
Name: count, dtype: int64

In [ ]:
data.dtypes

show_id         object
type            object
title           object
director        object
cast            object
country         object
date_added      object
release_year     int64
rating          object
duration        object
listed_in       object
description     object
dtype: object

In [ ]:
data['duration']=data['duration'].apply(lambda x:int(x.split()[0]))

In [ ]:
data[data['type']=='TV Show'].duration.value_counts()

duration
1     1608
2      378
3      183
4       86
5       57
6       30
7       19
8       18
9        8
10       5
11       2
15       2
12       2
13       1
16       1
Name: count, dtype: int64

In [ ]:
data[data['type']=='Movie'].duration.value_counts()

duration
90     136
93     131
91     125
94     125
95     119
      ...
36       1
201      1
253      1
203      1
191      1
Name: count, Length: 201, dtype: int64

In [ ]:
data.duration.dtypes

dtype('int64')

In [ ]:
data["date_added"] = pd.to_datetime(data['date_added'], format='mixed')

In [ ]:
data.date_added.min(), data.date_added.max()

(Timestamp('2008-01-01 00:00:00'), Timestamp('2021-01-16 00:00:00'))

In [ ]:
data['month_added'] = data['date_added'].dt.month
data['year_added'] = data['date_added'].dt.year
data.drop('date_added', axis=1, inplace=True)

In [ ]:
data.to_csv('Netflix_show.csv', index=False)

print("File 'data_pandas.csv' berhasil disimpan!")

File 'data_pandas.csv' berhasil disimpan!